class Solution:
    def isValid(self, s: str) -> bool:
        """Определяет, является ли строка, содержащая только символы скобок:
        '(', ')', '{', '}', '[' и ']', валидной.

        Строка валидна если выполняются условия:

        1. Открывающие скобки должны закрываться скобками того же типа
        2. Открывающие скобки должны закрываться в правильном порядке
        3. Каждая закрывающая скобка имеет соответствующую открывающую
        скобку того же вида

        Временная сложность:
        Пространственная сложность:

        Args:
            s (str): входная строка со скобками

        Returns:
            bool: является ли строка валидной
        """
        pass
